app/views/devise/registrations/new.html.erb

SELECT "states".* FROM "states" ORDER BY "states"."name" ASC
---
    <%= f.label 'Страна' %><br />
    <%= f.collection_select(:state_id,  State.all.order(:name), :id, :name, prompt: false)%>