app/views/recipes/edit.html.erb

SELECT "units".* FROM "units"
---
      <%= form.text_field :quantity %>
      <%= form.collection_select(:unit_id, Unit.all, :id, :name, prompt: false) %>