app/views/recipes/show.html.erb

<h2>Ingredients</h2>
<% @recipe.ingredients.each do |i| %>
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 1]]

    <%
      system_to_id = State.find( current_user.state_id).unit_system.id
---
SELECT "units".* FROM "units" WHERE "units"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "states".* FROM "states" WHERE "states"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "unit_systems".* FROM "unit_systems" WHERE "unit_systems"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

<h2>Comments</h2>
<% @recipe.coments.each do |comment| %>
---
SELECT "coments".* FROM "coments" WHERE "coments"."recipe_id" = ?  [["recipe_id", 3]]