app/views/states/_edit_new.html.erb

SELECT "unit_systems".* FROM "unit_systems" ORDER BY "unit_systems"."title" ASC
---
  Система единиц<br>
  <%= @form.collection_select(:unit_system_id,  UnitSystem.all.order(:title), :id, :title, prompt: true)%>