app/views/units/_edit_new.html.erb

SELECT "unit_systems".* FROM "unit_systems" ORDER BY "unit_systems"."title" ASC
---
  Система единиц<br>
  <%= @form.collection_select(:unit_system_id,  UnitSystem.all.order(:title), :id, :title, prompt: true)%>

SELECT "unit_kinds".* FROM "unit_kinds" ORDER BY "unit_kinds"."name" ASC
---
  Допускает конвертацию<br>
  <%= @form.collection_select(:unit_kind_id,  UnitKind.all.order(:name), :id, :name, prompt: true)%>