app/controllers/coments_controller.rb

  def create
    @recipe = Recipe.find(params[:recipe_id])
    @comment = @recipe.coments.create(coment_params)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "coments" ("recipe_id", "user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["recipe_id", 1], ["user_id", 1], ["body", "хорошо"], ["created_at", "2020-12-12 17:36:49.969563"], ["updated_at", "2020-12-12 17:36:49.969563"]]