app/controllers/ingredients_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "ingredients" ("recipe_id", "name", "quantity", "unit_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["recipe_id", 2], ["name", "мясо"], ["quantity", 1000.0], ["unit_id", 1], ["user_id", 1], ["created_at", "2020-12-12 18:49:50.122604"], ["updated_at", "2020-12-12 18:49:50.122604"]]
---
  def create
    @recipe = Recipe.find(params[:recipe_id])
    @ingredient = @recipe.ingredients.create(ingredient_params)