app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)
    if(@recipe.save)
---
INSERT INTO "recipes" ("user_id", "name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["name", "Жаренное мясо"], ["body", "Жарьте мясо"], ["created_at", "2020-12-12 18:30:36.350359"], ["updated_at", "2020-12-12 18:30:36.350359"]]

  def update
    @recipe = Recipe.find(params[:id])
    if(@recipe.update(recipe_params))
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "body" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["body", "Берешь картошку и жаришь"], ["updated_at", "2020-12-12 17:39:41.511253"], ["id", 1]]