app/controllers/states_controller.rb

  def index
    @states = State.all
---
SELECT "states".* FROM "states"

  def show
    @state = State.find(params[:id])
---
SELECT "states".* FROM "states" WHERE "states"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @state = State.new(state_params)

    if(@state.save)
---
INSERT INTO "states" ("name", "unit_system_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Россия"], ["unit_system_id", 3], ["created_at", "2020-12-02 20:18:29.335197"], ["updated_at", "2020-12-02 20:18:29.335197"]]

  def edit
    @state = State.find(params[:id])
---
SELECT "states".* FROM "states" WHERE "states"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @state = State.find(params[:id])
---
SELECT "states".* FROM "states" WHERE "states"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def destroy
    @state = State.find(params[:id])
    @state.destroy
---
SELECT "states".* FROM "states" WHERE "states"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "states" WHERE "states"."id" = ?  [["id", 9]]