app/controllers/units_controller.rb

SELECT "units".* FROM "units" ORDER BY "units"."name" ASC
---
  def index
    @units = Unit.order(:name).all

SELECT "units".* FROM "units" WHERE "units"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @unit = Unit.find(params[:id])

INSERT INTO "units" ("name", "symbol", "unit_system_id", "created_at", "updated_at", "unit_kind_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Литр"], ["symbol", "л"], ["unit_system_id", 3], ["created_at", "2020-12-03 11:37:13.878305"], ["updated_at", "2020-12-03 11:37:13.878305"], ["unit_kind_id", 2]]
---
  def create
    @unit = Unit.new(unit_params)

    if(@unit.save)

SELECT "units".* FROM "units" WHERE "units"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @unit = Unit.find(params[:id])

SELECT "units".* FROM "units" WHERE "units"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "units" SET "name" = ?, "symbol" = ?, "updated_at" = ? WHERE "units"."id" = ?  [["name", "Грамм"], ["symbol", "г"], ["updated_at", "2020-12-03 10:23:47.278047"], ["id", 1]]
---
  def update
    @unit = Unit.find(params[:id])
    if(@unit.update(unit_params))