app/controllers/unit_kinds_controller.rb

SELECT "unit_kinds".* FROM "unit_kinds" ORDER BY "unit_kinds"."name" ASC
---
  def index
    @unit_kinds = UnitKind.order(:name).all

INSERT INTO "unit_kinds" ("name", "is_can_convert", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Вес"], ["is_can_convert", 1], ["created_at", "2020-12-03 11:07:18.131683"], ["updated_at", "2020-12-03 11:07:18.131683"]]
---
  def create
    @unit_kind = UnitKind.new(unit_kind_params)

    if(@unit_kind.save)