app/controllers/unit_systems_controller.rb

  def index
    @unit_systems = UnitSystem.all
---
SELECT "unit_systems".* FROM "unit_systems"

  def create
    @unit_system = UnitSystem.new(unit_system_params)
    if(@unit_system.save)
---
INSERT INTO "unit_systems" ("title", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Метрическая система"], ["comment", ""], ["created_at", "2020-12-02 11:00:21.038555"], ["updated_at", "2020-12-02 11:00:21.038555"]]

  def update
    @unit_system = UnitSystem.find(params[:id])
    if(@unit_system.update(unit_system_params))
---
SELECT "unit_systems".* FROM "unit_systems" WHERE "unit_systems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "unit_systems" SET "title" = ?, "comment" = ?, "updated_at" = ? WHERE "unit_systems"."id" = ?  [["title", "Английская система"], ["comment", "Используется в Англии, США и некоторых других странах бывшей империи"], ["updated_at", "2020-12-02 12:32:07.622876"], ["id", 2]]

  def edit
    @unit_system = UnitSystem.find(params[:id])
---
SELECT "unit_systems".* FROM "unit_systems" WHERE "unit_systems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @unit_system = UnitSystem.find(params[:id])
---
SELECT "unit_systems".* FROM "unit_systems" WHERE "unit_systems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @unit_system = UnitSystem.find(params[:id])
    @unit_system.destroy
---
SELECT "unit_systems".* FROM "unit_systems" WHERE "unit_systems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "unit_systems" WHERE "unit_systems"."id" = ?  [["id", 1]]