app/controllers/unit_converts_controller.rb

  def index
    @unit_converts = UnitConvert.all
---
SELECT "unit_converts".* FROM "unit_converts"

  def show
    @unit_convert = UnitConvert.find(params[:id])
---
SELECT "unit_converts".* FROM "unit_converts" WHERE "unit_converts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @unit_convert = UnitConvert.new(unit_convert_params)

    if(@unit_convert.save)
---
INSERT INTO "unit_converts" ("unit_from_id", "unit_to_id", "ratio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["unit_from_id", 9], ["unit_to_id", 2], ["ratio", 4.5461], ["created_at", "2020-12-04 09:07:34.789584"], ["updated_at", "2020-12-04 09:07:34.789584"]]

  def edit
    @unit_convert = UnitConvert.find(params[:id])
---
SELECT "unit_converts".* FROM "unit_converts" WHERE "unit_converts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @unit_convert = UnitConvert.find(params[:id])
    if(@unit_convert.update(unit_convert_params))
---
SELECT "unit_converts".* FROM "unit_converts" WHERE "unit_converts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "unit_converts" SET "unit_to_id" = ?, "updated_at" = ? WHERE "unit_converts"."id" = ?  [["unit_to_id", 6], ["updated_at", "2020-12-04 11:43:19.968027"], ["id", 1]]