app/models/unit_convert.rb

SELECT "unit_converts".* FROM "unit_converts" WHERE (unit_from_id=1 and unit_to_id in (select id from units where unit_system_id=2 and unit_kind_id=1))
SELECT "unit_kinds".* FROM "unit_kinds" WHERE "unit_kinds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "units".* FROM "units" WHERE (unit_system_id=2 and unit_kind_id=1) ORDER BY "units"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "unit_converts".* FROM "unit_converts" WHERE (unit_to_id=1 and unit_from_id in (select id from units where unit_system_id=2 and unit_kind_id=1))
SELECT "units".* FROM "units" WHERE "units"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "unit_converts".* FROM "unit_converts" WHERE (unit_from_id=6 and unit_to_id=1) ORDER BY "unit_converts"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "unit_converts".* FROM "unit_converts" WHERE (unit_from_id=6 and unit_to_id=1) ORDER BY "unit_converts"."ratio" ASC
---
  def self.do_convert(unit_from, unit_system_to_id, value)
    unit_name = unit_from.name
    system_from_id = unit_from.unit_system_id

    # Если используется одна система единиц, возвращаем исходные значения
    if system_from_id == unit_system_to_id
      return value, unit_name, nil
    end
    # Выбираем прямые преобразования
    converts = Array.new
    UnitConvert.where('unit_from_id=? and unit_to_id in (select id from units where unit_system_id=? and unit_kind_id=?)', unit_from.id,unit_system_to_id,unit_from.unit_kind).each do |u|
      converts.push( {ratio: u.ratio, unit_name: u.unit_to.name } )
    end
    # Добавляем обратные преобразования
    UnitConvert.where('unit_to_id=? and unit_from_id in (select id from units where unit_system_id=? and unit_kind_id=?)', unit_from.id,unit_system_to_id,unit_from.unit_kind).each do |u|
      converts.push( {ratio: 1.0/u.ratio, unit_name: u.unit_from.name } )
    end

    # Если нет переобразования, возвращаем исходные значения
    if converts.length == 0
      return value, unit_name, nil
    end

    # Ищем приемлемое значение (не слишком маленькое и не слишком большое)
    # Если условие не выполнено, будет выведенно постеднее найденое значение
    v = value
    converts.each do |c|