app/models/unit.rb

  def self.obj_to_hash(filter)
    h = Hash.new
    Unit.where(filter).each do |o|
---
SELECT "units".* FROM "units" WHERE (unit_kind_id<3)